; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/blocksworld/domain.pddl
;;
(define (domain blocksworld)

(:requirements :strips)

(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=15, out_folder=training/easy, instance_id=50, seed=77

(define (problem blocksworld-50)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on b7 b3)
    (on-table b3)
    (clear b1)
    (on b1 b9)
    (on b9 b15)
    (on b15 b8)
    (on b8 b10)
    (on b10 b14)
    (on b14 b2)
    (on b2 b11)
    (on b11 b12)
    (on b12 b4)
    (on b4 b6)
    (on b6 b5)
    (on b5 b13)
    (on-table b13))
 (:goal  (and 
    (clear b15)
    (on b15 b3)
    (on b3 b7)
    (on b7 b1)
    (on b1 b14)
    (on b14 b5)
    (on b5 b6)
    (on b6 b11)
    (on b11 b10)
    (on b10 b2)
    (on b2 b12)
    (on b12 b13)
    (on b13 b4)
    (on b4 b8)
    (on b8 b9)
    (on-table b9))))

; plan
1. (unstack b1 b9)
   deleted: (on b1 b9) (clear b1) (arm-empty)
   added: (holding b1) (clear b9)
   goals met: 0 of 16
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 16
3. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 0 of 16
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 16
5. (unstack b9 b15)
   deleted: (on b9 b15) (clear b9) (arm-empty)
   added: (holding b9) (clear b15)
   goals met: 1 of 16
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 16
7. (unstack b15 b8)
   deleted: (on b15 b8) (clear b15) (arm-empty)
   added: (holding b15) (clear b8)
   goals met: 1 of 16
8. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 16
9. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 2 of 16
10. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 16
11. (unstack b10 b14)
   deleted: (on b10 b14) (clear b10) (arm-empty)
   added: (holding b10) (clear b14)
   goals met: 2 of 16
12. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 16
13. (unstack b14 b2)
   deleted: (on b14 b2) (clear b14) (arm-empty)
   added: (holding b14) (clear b2)
   goals met: 2 of 16
14. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 16
15. (unstack b2 b11)
   deleted: (on b2 b11) (clear b2) (arm-empty)
   added: (holding b2) (clear b11)
   goals met: 2 of 16
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 16
17. (unstack b11 b12)
   deleted: (on b11 b12) (clear b11) (arm-empty)
   added: (holding b11) (clear b12)
   goals met: 2 of 16
18. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 16
19. (unstack b12 b4)
   deleted: (on b12 b4) (clear b12) (arm-empty)
   added: (holding b12) (clear b4)
   goals met: 2 of 16
20. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 16
21. (unstack b4 b6)
   deleted: (on b4 b6) (clear b4) (arm-empty)
   added: (holding b4) (clear b6)
   goals met: 2 of 16
22. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 16
23. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 2 of 16
24. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 16
25. (unstack b5 b13)
   deleted: (on b5 b13) (clear b5) (arm-empty)
   added: (holding b5) (clear b13)
   goals met: 2 of 16
26. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 16
27. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 2 of 16
28. (stack b8 b9)
   deleted: (clear b9) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b9)
   goals met: 3 of 16
29. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 16
30. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 4 of 16
31. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 4 of 16
32. (stack b13 b4)
   deleted: (clear b4) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b4)
   goals met: 5 of 16
33. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 5 of 16
34. (stack b12 b13)
   deleted: (clear b13) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b13)
   goals met: 6 of 16
35. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 16
36. (stack b2 b12)
   deleted: (clear b12) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b12)
   goals met: 7 of 16
37. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 7 of 16
38. (stack b10 b2)
   deleted: (clear b2) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b2)
   goals met: 8 of 16
39. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 8 of 16
40. (stack b11 b10)
   deleted: (clear b10) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b10)
   goals met: 9 of 16
41. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 9 of 16
42. (stack b6 b11)
   deleted: (clear b11) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b11)
   goals met: 10 of 16
43. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 10 of 16
44. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 11 of 16
45. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 11 of 16
46. (stack b14 b5)
   deleted: (clear b5) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b5)
   goals met: 12 of 16
47. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 12 of 16
48. (stack b1 b14)
   deleted: (clear b14) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b14)
   goals met: 13 of 16
49. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 13 of 16
50. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 14 of 16
51. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 14 of 16
52. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 15 of 16
53. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 14 of 16
54. (stack b15 b3)
   deleted: (clear b3) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b3)
   goals met: 16 of 16
